# This script facilitates the use of this word list of the 9933 characters as a dictionary:
# Source: https://lingua.mtsu.edu/chinese-computing/statistics/char/list.php?Which=MO

library(readr)
dic <- read_delim('source-data/mtsu_dic.txt', delim = '\t', col_names = F)
dic <- dic[, c(2, 5)]
colnames(dic) <- c('word', 'sound')
for(i in 1:nrow(dic)){
  dic$sound[i] <- strsplit(dic$sound[i], '/')[[1]][1]
}

dic <- rbind(dic, c('亂', 'luan4'), c('倫', 'lun2'))

# Temporary solution for words not in the dictionary that are sometimes banned:
for(i in c("亞", "盃", "籃", "標", "賽", "佔", "環", "來", "俠", "獵", "倖", "偉", "偽", "傒", "傳", "兌", "兒", "內", "參", "兩", "個", "務", "業", "協", "兲", "冚", "冨", "樫", "劉", "備", "剛", "愷", "憲", "暁", "曉", "東", "強", "勝", "劍", "價", "學", "吳", "國", "峯", "潔", "呂", "啟", "喪", "單", "戀", "嚴", "問", "幫", "勢", "宮", "圓", "圖", "團", "報", "堺", "増", "壇", "夢", "師", "奧", "獎", "姦", "娛", "樂", "媽", "孫", "員", "園", "澤", "駿", "實", "島", "寫", "寵", "專", "屄", "屌", "屍", "對", "岡", "崑", "嵐", "戰", "濤", "幹", "幾", "庫", "爾", "廣", "涼", "張", "榮", "愛", "懸", "嶽", "堯", "樺", "鈞", "靚", "穎", "嬪", "彈", "復", "惡", "條", "僕", "戲", "灣", "戶", "擁", "擴", "攔", "憶", "敗", "斷", "時", "書", "熱", "沒", "綫", "梶", "楊", "煉", "嬅", "準", "檳", "櫻", "凜", "權", "歐", "漢", "歡", "歷", "瘋", "殭", "氣", "沖", "淪", "湯", "溫", "寶", "潛", "諜", "濱", "烏", "魯", "毆", "無", "劇", "動", "畫", "婭", "熾", "燒", "燦", "爛", "產", "〇", "獨", "會", "獸", "獻", "現", "瑪", "曆", "瓊", "瑤", "瓏", "畢", "當", "瘂", "癟", "癩", "發", "嬤", "峽", "殺", "嬌", "覽", "賭", "場", "咲", "綺", "樹", "盧", "為", "傑", "湊", "旻", "瑯", "瑩", "紜", "區", "鑠", "硯", "機", "瀨", "們", "槍", "憐", "蕭", "塚", "寧", "優", "橋", "檔", "鱸", "撲", "壓", "濟", "醤", "牆", "瑋", "勵", "擊", "從", "繪", "潤", "鈔", "應", "幣", "沢", "産", "燈", "徹", "綸", "鎂", "晉", "嫚", "濃", "燊", "殤", "執", "澀", "樣", "爺", "壽", "數", "瘡", "儀", "鎧", "極", "慶", "幗", "梟", "汎", "叢", "則", "慾", "貳", "燭", "綾", "緘", "掃", "昇", "沇", "玹", "寬", "鎬", "楓", "鍾", "謙", "滿", "奮", "羣", "韋", "劃", "珣", "亖", "厶", "鬥", "倉", "憂", "馼", "決", "爭", "異", "鄭", "偵", "導", "塊", "珮", "靂", "瓈", "囧", "佈", "彌", "侶", "蕩", "婦", "玥", "堅", "帶", "嶋", "喬", "擬", "淵", "駟", "駒", "別", "災", "巖", "壘", "審", "瀧", "獄", "慘", "阝", "坴", "镸", "獅", "儲", "帳", "墳", "薩", "灝", "擋", "態", "廚", "擇", "寳", "凞", "瑄", "凱", "棟", "樓", "鉉", "雛", "桿", "蔭", "煙", "喚", "煩", "諫", "創", "勞", "壢", "將", "彙", "勍", "楨", "譚", "丨", "丿", "丶", "亠", "冫", "轅", "暢", "氵", "渦", "尋", "閩", "揮", "揚", "旼", "濕", "棧", "鮑", "鯉", "鳥", "鶯", "暐")){
  dic <- rbind(dic, c(i, "jin4"))
}

write_csv(dic, 'scripts/chinese_dic.csv')
